Examinator/src/InformationRegisters/ВопросыТестированийСУЗ/ВопросыТестированийСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВопросыТестированийСУЗ</name>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПодборки</name>
    <type>
      <types>CatalogRef.ЭлементыПодборкиСУЗ</types>
      <types>CatalogRef.ВопросыСУЗ</types>
    </type>
  </attributes>
  <dimensions>
    <name>СессияВыполненияТеста</name>
    <type>
      <types>DocumentRef.СессияЭлектронногоРесурсаСУЗ</types>
      <types>DocumentRef.ПопыткаВыполненияПодборкиВопросовСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вопрос</name>
    <type>
      <types>CatalogRef.ВопросыСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ОтветыНаВопросыСУЗ/ОтветыНаВопросыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтветыНаВопросыСУЗ</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПроведениеОбучения</name>
    <type>
      <types>DefinedType.ПроведениеЭлектронногоОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>СессияВыполненияТеста</name>
    <type>
      <types>DocumentRef.СессияЭлектронногоРесурсаСУЗ</types>
      <types>DocumentRef.ПопыткаВыполненияПодборкиВопросовСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Тест</name>
    <type>
      <types>CatalogRef.ПодборкиСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПсихологическийВопрос</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверяетсяПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверенПреподавателем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверившийПреподаватель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПоказов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованаПодсказка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазвернутыйОтветПользователя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийПреподавателя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вопрос</name>
    <type>
      <types>CatalogRef.ВопросыСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DefinedType.ПрохождениеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлементСодержания</name>
    <type>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ВопросыТестированийСУЗ/ManagerModule.bsl
Функция ВопросыТестирований(СессииВыполненияТеста) Экспорт	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВопросыТестированийСУЗ.Вес,
		|	ВопросыТестированийСУЗ.Вопрос,
		|	ВопросыТестированийСУЗ.СессияВыполненияТеста КАК СессияВыполненияТеста,
		|	ОтветыНаВопросыСУЗ.Период КАК Дата,
		|	ОтветыНаВопросыСУЗ.Результат,
		|	ОтветыНаВопросыСУЗ.ПсихологическийВопрос,
		|	ОтветыНаВопросыСУЗ.ПроверяетсяПреподавателем,
		|	ОтветыНаВопросыСУЗ.ПроверенПреподавателем,
		|	ОтветыНаВопросыСУЗ.ПроверившийПреподаватель,
		|	ОтветыНаВопросыСУЗ.КоличествоПоказов,
		|	ОтветыНаВопросыСУЗ.ИспользованаПодсказка,
		|	ОтветыНаВопросыСУЗ.РазвернутыйОтветПользователя,
		|	ОтветыНаВопросыСУЗ.КомментарийПреподавателя,
		|	ВопросыТестированийСУЗ.Вопрос.Наименование КАК НаименованиеВопроса,
		|	ВопросыТестированийСУЗ.Вопрос.ИспользуетсяФорматированныйДокумент КАК ИспользуетсяФорматированныйДокумент,
		|	ВопросыТестированийСУЗ.Вопрос.ТипВопроса КАК ТипВопроса
		|ИЗ
		|	РегистрСведений.ВопросыТестированийСУЗ КАК ВопросыТестированийСУЗ
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтветыНаВопросыСУЗ КАК ОтветыНаВопросыСУЗ
		|		ПО ВопросыТестированийСУЗ.СессияВыполненияТеста = ОтветыНаВопросыСУЗ.СессияВыполненияТеста
		|			И ВопросыТестированийСУЗ.Вопрос = ОтветыНаВопросыСУЗ.Вопрос
		|ГДЕ
		|	ВопросыТестированийСУЗ.СессияВыполненияТеста В(&СессииВыполненияТеста)
		|
		|УПОРЯДОЧИТЬ ПО
		|	СессияВыполненияТеста,
		|	Дата";
	
	Запрос.УстановитьПараметр("СессииВыполненияТеста", СессииВыполненияТеста);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выбрать();
	
КонецФункции
